<a href="https://colab.research.google.com/github/annLiu310/python-basic/blob/master/08_Missing_Data_Null_Value_Operation.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Missing Data

Let's show a few convenient methods to deal with Missing Data in pandas:

In [0]:
import numpy as np
import pandas as pd

In [10]:
# init data frame with dic, NaN   np.nan

d = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[2,3,4]} 
df = pd.DataFrame(d)
df

     A    B  C
0  1.0  5.0  2
1  2.0  NaN  3
2  NaN  NaN  4

In [11]:
# drop rows with null value
df.dropna()

     A    B  C
0  1.0  5.0  2

In [12]:
df

     A    B  C
0  1.0  5.0  2
1  2.0  NaN  3
2  NaN  NaN  4

In [14]:
# drop column with null values
df.dropna(axis=1)

   C
0  2
1  3
2  4

In [17]:
# add threshold un null values
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  2
1  2.0  NaN  3

In [18]:
# fill missing value
df.fillna(value='FILL VALUE')

            A           B  C
0           1           5  2
1           2  FILL VALUE  3
2  FILL VALUE  FILL VALUE  4

In [19]:
# use mean to fill value
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [21]:
df.fillna(value=-1)

     A    B  C
0  1.0  5.0  2
1  2.0 -1.0  3
2 -1.0 -1.0  4